In [1]:
import pandas as pd
import numpy as np

### Pandas
* Panel - Dataframe - Series
* Panel- Data more than 2 dimension
* Dataframe- Table like structure , 2D data, Matrix
* Series- Array like structure 1D Data
* These are the Three main data structure in pandas. Data Structure:- How data will store into Memory. *Data Types:-
* Pandas support Numeric and Object data types.
* Numeric:- integer , int64 , float
* Object:- String, Characters, Alphanumeric Characters, Symbols, Bits and Bytes.
* pandas is one of the most used data analytical library and module in python.
* Library:-set of method, function, objects and method.
* Pandas can be work with files, text, databases, websites and clouds.

In [2]:
arr = np.array(["Sun","Mon","Tue","Wed","Thr","Fri","Sat"])

In [3]:
# How to create pandas series

s1=pd.Series(arr,name="Weekdays")
s1

0    Sun
1    Mon
2    Tue
3    Wed
4    Thr
5    Fri
6    Sat
Name: Weekdays, dtype: object

In [4]:
s1.name

'Weekdays'

In [5]:
s2 = pd.Series([2,5,7,4], name="Number List")
s2

0    2
1    5
2    7
3    4
Name: Number List, dtype: int64

In [6]:
s3 = pd.Series((1,2,3,4,5))    #For Tuple
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# s4 = pd.Series(np.random.randint(1,26,24).reshape(6,4), name="Random_Numbers")
# we cannot create Series more than 1 Dimension

In [8]:
s3.dtype

dtype('int64')

In [9]:
s3.mean()

3.0

In [10]:
s2.mean()

4.5

In [11]:
s2.dtype

dtype('int64')

In [12]:
s3.std()

1.5811388300841898

In [13]:
d = {
    "std_names":["Chandu","Nandu","Bandu"],
    "Marks":[67,59,46]
}
d

{'std_names': ['Chandu', 'Nandu', 'Bandu'], 'Marks': [67, 59, 46]}

In [14]:
df = pd.DataFrame(d)
df

  std_names  Marks
0    Chandu     67
1     Nandu     59
2     Bandu     46

In [15]:
arr2 = np.random.randint(35, 99, 24).reshape(6,4)
arr2

array([[77, 39, 59, 59],
       [47, 60, 65, 65],
       [38, 89, 67, 95],
       [58, 84, 53, 49],
       [43, 70, 91, 94],
       [85, 85, 90, 57]])

In [16]:
df2 = pd.DataFrame(arr2)
df2

    0   1   2   3
0  77  39  59  59
1  47  60  65  65
2  38  89  67  95
3  58  84  53  49
4  43  70  91  94
5  85  85  90  57

In [17]:
df3 = pd.DataFrame(arr2,columns=["Math","English","Physics","Sport"])
df3

   Math  English  Physics  Sport
0    77       39       59     59
1    47       60       65     65
2    38       89       67     95
3    58       84       53     49
4    43       70       91     94
5    85       85       90     57

In [18]:
df3["Std_Name"] = ["Sachin","Rohit","Virat","Shubhnam","Ravindra","Rinku"]

In [19]:
df3

   Math  English  Physics  Sport  Std_Name
0    77       39       59     59    Sachin
1    47       60       65     65     Rohit
2    38       89       67     95     Virat
3    58       84       53     49  Shubhnam
4    43       70       91     94  Ravindra
5    85       85       90     57     Rinku

In [20]:
df3. columns

Index(['Math', 'English', 'Physics', 'Sport', 'Std_Name'], dtype='object')

In [21]:
# Question: Create a dataframe add new columns and change the position of the column
# How many ways to do this.

In [22]:
#Using a list 
data = {'Name':['Raj','Karan','Rohit'],
        'Age':[23,12,34],
        'Marks':[78,89,90]}
df=pd.DataFrame(data)
df

    Name  Age  Marks
0    Raj   23     78
1  Karan   12     89
2  Rohit   34     90

In [23]:
city=['Pune','Delhi','Mumbai']
df['city']= city 
df

    Name  Age  Marks    city
0    Raj   23     78    Pune
1  Karan   12     89   Delhi
2  Rohit   34     90  Mumbai

In [24]:
data={'Rahul': pd.Series([56,78,45,90]),
      'Raj':pd.Series([67,88,23,99])}
df=pd.DataFrame(data)
df

   Rahul  Raj
0     56   67
1     78   88
2     45   23
3     90   99

In [25]:
varun=[77,56,34,90]
df['varun']= varun          # Append Method
df

   Rahul  Raj  varun
0     56   67     77
1     78   88     56
2     45   23     34
3     90   99     90

In [26]:
# 2) Insert Method

In [27]:
df.insert(2,'Preeti',[78,23,12,0],True)
df

   Rahul  Raj  Preeti  varun
0     56   67      78     77
1     78   88      23     56
2     45   23      12     34
3     90   99       0     90

In [28]:
# 3)Assign method

In [29]:
df=df.assign(gaurav=[56,77,88,99])
df

   Rahul  Raj  Preeti  varun  gaurav
0     56   67      78     77      56
1     78   88      23     56      77
2     45   23      12     34      88
3     90   99       0     90      99

In [30]:
#4) Using a dictionary

In [31]:
data = {'Name':['Raj','Karan','Rohit'],
        'Age':[23,12,34],
        'Marks':[78,89,90]}

In [32]:
df=pd.DataFrame(data)
df

    Name  Age  Marks
0    Raj   23     78
1  Karan   12     89
2  Rohit   34     90

In [33]:
percentage={98:'Raj',
            90:'Karan',
            88:'Rohit'}
df['percentage']=percentage
df

    Name  Age  Marks percentage
0    Raj   23     78        NaN
1  Karan   12     89        NaN
2  Rohit   34     90        NaN

In [34]:
df3.head()     # to return the top 5 rows of dataframe,we can return as many rows by 
#giving number in head()

   Math  English  Physics  Sport  Std_Name
0    77       39       59     59    Sachin
1    47       60       65     65     Rohit
2    38       89       67     95     Virat
3    58       84       53     49  Shubhnam
4    43       70       91     94  Ravindra

In [35]:
df3.head(3)   # for showing top 3 rows

   Math  English  Physics  Sport Std_Name
0    77       39       59     59   Sachin
1    47       60       65     65    Rohit
2    38       89       67     95    Virat

In [36]:
df3.head(2)

   Math  English  Physics  Sport Std_Name
0    77       39       59     59   Sachin
1    47       60       65     65    Rohit

In [37]:
df3.tail(3)   # for bottom 3

   Math  English  Physics  Sport  Std_Name
3    58       84       53     49  Shubhnam
4    43       70       91     94  Ravindra
5    85       85       90     57     Rinku

In [38]:
df3.iloc[3:5]

   Math  English  Physics  Sport  Std_Name
3    58       84       53     49  Shubhnam
4    43       70       91     94  Ravindra

In [39]:
df3.loc[2:4]

   Math  English  Physics  Sport  Std_Name
2    38       89       67     95     Virat
3    58       84       53     49  Shubhnam
4    43       70       91     94  Ravindra

In [40]:
df3["Math"]

0    77
1    47
2    38
3    58
4    43
5    85
Name: Math, dtype: int32

In [41]:
type(df3["Math"])

pandas.core.series.Series

In [42]:
df3.iloc[1]

Math           47
English        60
Physics        65
Sport          65
Std_Name    Rohit
Name: 1, dtype: object

In [43]:
df2

    0   1   2   3
0  77  39  59  59
1  47  60  65  65
2  38  89  67  95
3  58  84  53  49
4  43  70  91  94
5  85  85  90  57

In [44]:
df2.iloc[0].mean()

58.5

In [45]:
# what is fancy indexing in python, give atleast 3 examples.

In [46]:
df3[["Math","English"]]

   Math  English
0    77       39
1    47       60
2    38       89
3    58       84
4    43       70
5    85       85

In [47]:
ls=[1,2,3,4,5,6,7]

In [48]:
ls[3:5]    # Doing Slicing

[4, 5]

In [49]:
df3.drop("Std_Name",axis=1, inplace= True)

In [50]:
df3

   Math  English  Physics  Sport
0    77       39       59     59
1    47       60       65     65
2    38       89       67     95
3    58       84       53     49
4    43       70       91     94
5    85       85       90     57

In [51]:
df4=pd.read_excel(r"C:\Users\wankh\Downloads\Sales.xlsx")
df4

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\wankh\\Downloads\\Sales.xlsx'

In [52]:
df5=pd.read_excel(r"Sales.xlsx")
df5

  Name  Sales
0    A   5000
1    B   5700
2    C   4200
3    D   4600
4    E   4900
5    F   4900
6    G   5900
7    H   3000